<!--  -->
<template>
  <div class="casecontent03">
    <div class="wrap">
      <div class="design-header">
        <div class="design-header-title color-white text-center">作品集</div>
      </div>
      <div class="content">
        <!-- 导航栏 开始 -->
        <div class="navbox">
          <!-- 搜索栏 -->
          <div class="searchbox">
            <form action class="parent">
              <input type="text" class="search" placeholder="请输入您要搜索的作品名称" />
              <input type="button" name id class="btn" />
            </form>
          </div>

          <!-- 导航列表 开始 -->
          <div class="navlist-ui">
            <ul>
              <li class="now" id="cur">
                <a href="#">UI设计</a>
              </li>
              <li>
                <a href="#">网页设计</a>
              </li>
              <li>
                <a href="#">平面设计</a>
              </li>
              <li>
                <a href="#">手绘插画</a>
              </li>
              <li>
                <a href="#">其他</a>
              </li>
            </ul>
          </div>
          <!-- 导航列表 结束 -->
        </div>
        <!-- 导航栏 结束 -->
        <MenuComponent></MenuComponent>
        <div class="backtop">
          <a href="#top" target="_self">
            <img src="./../../assets/img/icon_backtop.png" alt />
          </a>
        </div>

        <!-- 文章box 开始 -->
        <div class="articalbox">
          <div class="maintitle text-center">卡片分类法八大步骤，帮你确定产品信息架构</div>
          <div
            class="note-date text-center"
          >2019-05-21&nbsp;&nbsp;&nbsp;&nbsp;in&nbsp;&nbsp;作品集/UI设计</div>
          <div class="line"></div>
          <div class="note-content">
            卡片分类法可以用于网站或应用的导航、信息架构等项目，也可以用于文档、电子书籍的结构整理或是文件的分类管理等。
            <br />
            <br />
            <h3>卡片分类法定义</h3>
            <br />卡片分类法（Card Sorting）是指让用户将信息结构的代表性元素的卡片进行分类而取得用户期望的研究方法。
            <br />
            <br />
            <img src="./../../assets/img/workpic16.jpg" />
            △ 卡片分类法
            <br />
            <br />卡片分类法主要是对碎片化的元素进行归类，使之形成分组的具有包含关系的信息架构。
            <br />
            <br />
            <h3>卡片分类法适用类型</h3>
            <br />卡片分类法在信息化产品上的应用，一般用于以下类型的项目：
            <br />①网站或应用的导航、信息架构
            <br />②文档、电子书籍的结构整理
            <br />③文件的分类管理
            <br />
            <br />
            <h3>卡片分类法操作步骤</h3>
            <br />卡片分类法实际操作步骤大致如下图所示，下面我会具体讲解每一步的操作方法。
            <br />
            <img src="./../../assets/img/workpic17.jpg" alt />
            <br />△ 卡片分类法操作步骤
            <br />
            <br />
            <h3>1. 确定目标</h3>
            <br />首先要明确你想要使用卡片分类法解决什么样的问题，即你所面临的问题的解决方法。
            卡片分类法是不是一个最优的解决方案？卡片分类法特别适合用于解决那些子级信息元素庞杂，
            同时设计者又不能确定每个子级信息元素明确归属于哪一类，甚至可能连如何进行分类都不能确定的情况。
            <br />
            <br />比如网站要进行重构，总共可以分为多少个大类？哪些版块应该归为一类？哪些版块应该独立出来？
            哪些版块应该进行合并？
            <br />
            <br />或者要新设计一个应用，我应该如何确定一级导航和二级导航？哪些信息需要独立出来？
            <br />
            <br />
            <img src="./../../assets/img/workpic18.jpg" alt />
            <br />△ 对于子级元素庞杂混乱的项目，适合用卡片分类法
            <br />
            <br />遇到这些类型的项目时，卡片分类法就是特别适合的解决方案。
            而大的信息架构已经确定且分类合理，
            只是不确定一个小功能如何添加进大的信息架构中，就不适合使用卡片分类法。
            <br />
            <img src="./../../assets/img/workpic19.jpg" alt />
            <br />△ 单个功能加入信息架构不适合卡片分类
            <br />
            <br />或者产品信息元素特别少，只有寥寥几个主要功能的情况下，也不适合使用卡片分类法。
            <br />
            <br />
            <img src="./../../assets/img/workpic20.jpg" alt />
            <br />△ 只有有限信息元素的产品，也不适合卡片分类法
            <br />
            <br />只有确定了信息元素的数量适合进行卡片分类，且希望通过卡片分类法，
            能够理清信息元素相互之间的逻辑关系，形成一个完整且清晰的信息架构的目标前提，
            才能够进入卡片分类步骤流程。
            <br />如果连自己要实现的目标都不清晰就稀里糊涂地使用卡片分类法，
            那就是本末倒置，毕竟卡片分类法本身只是一个工具，而工具是要为目的服务的。
            <br />
            <br />
            <h3>2. 确定信息元素</h3>
            <br />
            <img src="./../../assets/img/workpic21.jpg" alt />
            <br />△ 确定信息元素
            <br />
            <br />在确定了当前的项目适合使用卡片分类法以后，接下来就需要确定需要进行分析的信息项卡片了。
            确定需要进行分析的卡片一般遵循如下原则。
            <br />
            <h4>尽量不要把父级项和子级项混在一起</h4>
            <img src="./../../assets/img/workpic22.jpg" alt />
            <br />△ 不要把父级项和子级项混在一起
            <br />
            <br />卡片分类法有一个重要的步骤就是确定分组群簇，群簇名也就是父级的定义甚至可以交给被调研者自己完成，
            这个后面会讲到。在卡片设计时尽量把颗粒度固定在一个层级上，有利于分类的科学性和合理性。
            <br />
            <br />如明确「商城」、「婴儿用品」、「洗护用品」三个信息项之间有明确无误地包含关系，
            则需要对卡片做出调整和筛选。
            <br />
            <br />当然读者到这里可能有一个疑惑：「我本来就是需要卡片分类法帮我确定某些信息项的逻辑关系呀，
            如果我明确知道他们之间的包含关系我为什么还需要卡片分类？」对于完全不能确定相互之间是否有父级子级
            包含关系的信息项，就可以一起放入卡片，一般是可以通过分析推导出他们之间的逻辑关系的。
            <br />
            <br />
            <h4>信息项卡片数量不能太少</h4>如果只有有限几个元素，则没必要进行卡片分类法，只需要进行简单的用户调研即可。
            <br />
            <br />
            <h4>信息项卡片不要选择颗粒度太细的层级。</h4>在信息项卡片的选择上，需要对颗粒度进行规范和定义，把颗粒度聚焦在有十几到几十张卡片的层级比较适合，
            被调研者在这个卡片数量范围内比较容易集中注意力和发挥逻辑思维能力，不建议把信息项颗粒度拆分细化到
            非常零碎的层级，这样对被调研者和分析者都会是一个很大的考验，毕竟我们是需要卡片分类法来对我们的
            设计做验证或提供信息参照，而不是完全按照结果去设计产品。
            <br />
            <br />
            <h4>卡片名称要描述清晰，定义清楚，没有歧义</h4>伏尔泰曾说过：「要是你想与我交谈，那请先对自己的用语下个定义。」
            <br />要确保自己和被调研人群在同一个频道说话，并且是在说同一件事情。
            <br />如果觉得卡片名称可能比较难以理解或可能会让被调研人群产生迷惑，
            请在卡片名称下添加这个卡片名称的具体描述。
            <br />
            <br />
            <h3>3. 选择合适的卡片分类法</h3>
            <img src="./../../assets/img/workpic23.jpg" alt />
            <br />△ 选择合适的卡片分类法
            <br />
            <br />卡片分类法在用户调研领域有很多具体的操作方法，形式上也有多种，按照分类方式不同可以分为：
            <br />
            <br />
            <h4>①封闭式</h4>
            <br />封闭式分类法是指发起人预先设置好卡片分组，要求被调研者把所有卡片按照自己的理解放入预设好的分组
            下的分类方法。
            <br />
            <br />封闭式方法适合于产品已经预先确定了大的信息架构的情况下，或者发起人明确知道信息项应该属于
            哪些分组的情况下使用。封闭式方法的好处是目标明确，对于验证自己的推论或设计的情况下，
            让分析结果的分类在和自己预设的分类相同的基础上再进行比较。
            <br />
            <img src="./../../assets/img/workpic24.jpg" alt />
            <br />△ 封闭式分类法
            <br />
            <br />封闭式方法最好预留一个「其他」分组，以防止用户在无法把某个信息项合理归入预设组时随意放置而
            导致影响样本准确性。
            <br />
            <br />
            <h4>②开放式</h4>
            <br />开放式分类法是指不预设分组，让用户自行决定所有信息项应该有
            几个分组以及分别归属于哪些分组的分类方法。
            <br />
            <br />开放式分类法适合于那些发起人自己也不确定自己所有的信息项属于哪些分类群簇，且不确定到底应该有多少分类群簇的情况，这种分类法适合于产品尚处于筹划阶段，连功能点和业务范围也还没有确定的项目，
            这种分类法的分析结果一般不是用来做设计验证，而是用来作为产品信息架构参考，
            为设计产品信息架构打好基础。
            <br />
            <img src="./../../assets/img/workpic25.jpg" alt />
            <br />△ 开放式分类法
            <br />
            <br />而这种分类方法的分析结果也往往能够带给发起者惊喜，
            发现隐藏在那些信息项之间非常隐蔽的逻辑关系。因为脱离了发起者预设分组的羁绊，
            被调研者往往能够更加关注卡片相互之间的逻辑关系。
            <br />
            <br />
            <h3>4. 选择参与分类对象</h3>接下来就需要确定参与卡片分类调研的人员了。
            <br />
            <img src="./../../assets/img/workpic26.jpg" alt />
            <br />△ 选择参与分类对象
            <br />
            <br />对于参与卡片分类调研的人群，还是有一定的要求的。
            <br />
            <br />
            <h4>与卡片分类法所服务项目有直接利益关系的需要尽量排除</h4>
            <br />卡片分类法所提供的调研结果是要服务于所属项目的，所以如果把参与项目的开发、测试、产品等相关人员包含在调研里，
            这些人群会因为自身的利害关系而选择对自己有利的分类方法，从而影响结果的客观公正性。
            <br />
            <br />在样本数特别大的卡片分类法调研里，可以谨慎地选取有限数量的利益相关人群，
            因为数量少而不大会对结果产生严重干扰。这个比例需要严格控制。
            <br />
            <br />
            <H4>逻辑思维能力极差的人群需要尽量排除</H4>
            <br />因为卡片分类法需要被调研人群具有较强的逻辑思维能力，最终结果才能比较符合客观现实，
            如果邀请的都是思路不清楚，逻辑混乱的低素质人群，那不但会有极大概率得不到想要的结果，
            还会影响整个项目的推进。
            <br />
            <br />
            <H4>与卡片分类法所属项目完全没有交集的人群需尽量排除</H4>
            <br />虽然卡片分类法的每张卡片的名称下都要求尽量附加详细的解释信息来说明当前卡片代表含义，但如果所属项目比较抽象复杂，这时候被调研人群是完全不同行业或没有任何使用体验，也可能会影响到调研结果的准确性。
            <br />
            <br />比如要分析一个区块链产品，而调研对象是街上随机招募的游客人群，结果可想而知。
            <br />
            <br />因为我自己所处行业的关系，我一般在做卡片式分类法时，更倾向于找跟项目无关的交互设计师或产品经理朋友。
            <br />
            <br />以上几点在有条件的情况下注意实施，就可以在选取被调研人群的时候不犯错误或少犯错误。
            <br />
            <br />
            <H3>5. 选择卡片分类：线上/线下</H3>
            <br />现在终于进入对于卡片分类来说最重要的环节了，那就是：进行卡片分类。
            <br />
            <img src="./../../assets/img/workpic27.jpg" alt />
            <br />进行卡片分类具体操作方法可以根据项目实际情况分为以下几种。
            <br />
            <br />
            <H4>线下场景现场调研</H4>
            <br />预订一个会议室：
            <br />
            <br />
            <img src="./../../assets/img/workpic28.jpg" alt />
            <br />△ 预订会议室
            <br />
            <br />预订会议室或使用专业的用户调研室是为了让调研被控制在一个相对封闭，不容易被外界影响和
            干扰的空间内进行。如果是开放的环境，周围的不参与调研的无关人员可能会干预影响被调研人
            群的逻辑思考过程，另外被调研人群也需要一个相对安静的环境来深入思考分组的合理性。
            <br />
            <br />邀约被调研人群：
            <br />
            <img src="./../../assets/img/workpic29.jpg" alt />
            <br />△ 邀约被调研人群
            <br />
            <br />被调研人群名单确定后，发起调研邀请，尽量让被调研人群在同一时间参与调研，
            一方面可以避免反复解释项目背景和元素描述，另一方面也可以保证每个被调研对象的接收信息一致。
            <br />
            <br />制作卡片 ：
            <br />
            <img src="./../../assets/img/workpic30.jpg" alt />
            <br />△ 一组卡片制作
            <br />
            <br />卡片一定要采用统一规格、质地、颜色的卡片纸。
            如果条件限制无法保证所有的卡片规格、质地、颜色都完全一致，也要最低限度保证每个被调研对象
            拿到的那一组卡片的规格质地颜色一致，以避免因为材质不同而对用户造成心理暗示，从而影响用户的判断。
            <br />
            <br />我在进行卡片分类法调研时，一般采用同色的便利贴，使用便利贴的好处是不容易被气流和人为干扰，
            同时不影响重新调整，方便统计。
            <br />
            <br />我不是很建议发给每个被调研对象多种颜色的便利贴让用户根据分组不同自由选择不同颜色的调研方式。
            <br />
            <br />
            <img src="./../../assets/img/workpic31.jpg" alt />
            <br />△ 避免让用户自己选择
            <br />
            <br />不同颜色卡片代表不同分组因为卡片分类本身就是一个不断调整、不断打破原来的思维定势的逻辑推理过程，
            如果让用户一开始就选择不同颜色代表不同分类，一方面会导致用户思维固化，另一方面也不方便及时修改。
            <br />
            <br />准备与被调研人数相应份数的卡片，时间充裕的情况下可以由调研发起人自己准备好卡片，
            如果时间比较紧张可以把所有卡片项写在黑板上让用户自己填，但这样就存在一个样本可能会被污染或损坏的情况。
            <br />
            <br />每张卡片标注名称，标好编号以便后期统计：这种方法的好处是可以在调研开始前，
            对项目的整体情况和信息元素做细致而详尽的解释说明，这样被调研人群存在疑问可以现场解释，
            并能尽最大可能地了解用户在做出某个选择时的想法和逻辑思考方式。
            <br />
            <br />让参与者开始卡片分类：
            <br />
            <img src="./../../assets/img/workpic32.jpg" alt />
            <br />△ 参与者开始卡片分类
            <br />
            <br />卡片分类所有准备工作都完成以后，组织者就可以宣布分类开始了，组织者可以在被调研对象身边观察被调研
            对象的分类行为并进行简单记录或视频记录，同时可以为被调研对象答疑解惑，解释一些名词的具体定义，
            但切记千万不要用自己的想法干扰被调研对象的分类行为。
            <br />
            <br />如果被调研对象做出了一个大大超出组织者心理预期的分类行为，或可能暗示着被调研对象对当前卡片名
            称定义产生误解的分类行为，组织者可以当场询问被调研对象的行为动机和行动原因。如果是一种比较独
            特的思路，组织者可以把这种思路记录下来，但不要用自己的想法干扰用户的选择。
            <br />
            <br />如果是被调研对象对卡片名称的定义产生了误解导致，可以当场重新解释卡片名称的定义，直到对方明确
            理解为止。如果发现多个被调研对象都做出了类似行为，那么就要当场纠正更新卡片名称定义以避免歧义。
            <br />
            <br />线下卡片分类调研结束：
            <br />
            <br />在所有被调研对象都明确表示自己的分类已经完全合理，不需要再调整的情况下，组织者就可以宣布调研
            结束了，然后可以口头或以物质形式对参与者表示感谢，然后请被调研对象离场。
            <br />
            <br />被调研人群离开后，组织者首先要在每组卡片上标明是哪个被调研对象的分类结果以方便后期追溯，
            然后对每组的现场拍照存档以供后期调研分析。
            <br />
            <br />
            <H4>线上调研</H4>
            <br />线上调研可以继续细分为线上简单咨询和简单统计工具和专业工具三种。
            <br />
            <br />线上简单咨询：
            这种方式比较随意，一般是通过在线沟通软件把自己的意图、目标、卡片项、分组要求发送给被调研对象，
            然后从被调研对象那里收集反馈结果。
            优点是适合于非正式的场合且可以大撒网，然后选择符合标准的答案来作为样本。
            缺点是需要同一个个被调研对象具体沟通细节，沟通成本较高。且反馈答案五花八门，难以把卡片分组结
            果标准化。
            <br />
            <br />简单统计工具：
            可以使用图标制作工具比如 Visio，在线图表工具如迅捷思维导图，或者简单的 Excel 表格。
            <br />
            <br />
            <img src="./../../assets/img/workpic33.jpg" alt />
            <br />△ 用在线绘图工具进行卡片分类
            <br />
            <br />在使用这些工具的时候，一定要把卡片选项事先明确输入这些工具，以保证结果的标准化。
            专业卡片分类工具：
            专业在线卡片式分类调研工具现在有多款，我使用最多，觉得最方便的是 Optimalworkshop，
            因为它不但提供了在线调研工具，还能够直接对调研结果进行分析并给出专业结论。
            <br />
            <br />
            <img src="./../../assets/img/workpic34.jpg" alt />
            <br />△ Optimalworkshop
            <br />
            <br />注意，这里说的专业工具仅指进行调研所使用的工具，而不是指最终分析的专业工具（如EZSORT）。
            <br />
            <br />Optimalworkshop 提供多个线上调研工具和数据追踪工具，卡片分类只是它提供的功能之一，
            这个工具分免费版和收费版两种，免费版允许招募 10 个被调研对象，收费版可以招募更多，
            但如果只是想要验证一个信息架构，那么使用免费版已经可以基本满足需求，如果是要进行
            全新的不预设立场的调研，那么收费版还是物有所值的。
            <br />
            <br />在进行线上调研之前，首先你需要预先设置好开始前的所有准备环节，Optimalworkshop
            之所以好用是因为它基本考虑到了所有的前置环节的详细说明，包括公司 LOGO、调研题目、
            调研目标、调研描述等等，填写好所有这些信息以后，基本上只需要发送一个链接给对方，
            对方就可以开始分类工作了，基本不需要额外说明。
            <br />
            <br />
            <img src="./../../assets/img/workpic35.jpg" alt />
            <br />△ 卡片分类准备工作
            <br />
            <br />在调研开始之前，如果你想对被调研对象的一些属性进行进一步的分类和分析，你还可以设置前置调研问卷。
            <br />
            <br />
            <img src="./../../assets/img/workpic36.jpg" alt />
            <br />△ 卡片选项
            <br />
            <br />可以从外部导入，也可以手动添加，如果担心卡片名称定义不够清晰，还可以填写卡片名称的具体描述信息，确实非常贴心。
            <br />
            <br />
            <img src="./../../assets/img/workpic37.jpg" alt />
            <br />△ 卡片分类法操作步骤
            <br />
            <br />在设置所有的前置选项全部完成以后，就可以把链接发送给被调研对象了。
            <br />
            <br />被调研对象在点击链接后，进入卡片分类操作界面。这个操作过程非常简单易用，只需要把左侧卡片栏里的卡片拖动到右侧工作区，
            然后再进行分组即可完成，完全是所见即所得（WYSIWYG）方式。
            <br />
            <br />
            <img src="./../../assets/img/workpic38.jpg" alt />
            <br />△ 拖动卡片进入操作区
            <br />
            <br />
            <img src="./../../assets/img/workpic39.jpg" alt />
            <br />△ 对卡片分组完成后，点击「Finished」即可完成当前调研。
            <br />
            <br />卡片分类组织者在收到足够的样本数后（免费版为 10 份），就基本完成卡片分类调研工作了。
            <br />
            <br />这种线上卡片分类调研工作的优势是组织成本低，基本只需要组织者一个人就够了，相比线下方式，
            更加灵活机动，而且可以比较自由地选择可用样本，基本不存在样本可用问题。
            <br />
            <br />但缺点就是如果前期准备工作不足，或卡片命名定义不清楚，被调研对象很难快速与组织者沟通解决，
            可能会存在因理解偏差导致的分析不准确的情况。
            <br />
            <br />所以说，好的工具能够事半功倍，帮助我们快速解决问题，但工具始终是工具，不能太依赖工具，
            因为最后使用工具的是人，而享受最终成果的，也是人。
            <br />
            <br />
            <h3>6. 信息整理分析</h3>
            <br />不论是通过线上还是线下方式，在收集到符合要求的卡片分类样本后，就可以开始进行信息的整理分析了。
            <br />
            <br />
            <img src="./../../assets/img/workpic40.jpg" alt />
            <br />△ 信息整理分析
            <br />
            <br />首先我们获取了一张原始数据图表：
            <br />
            <img src="./../../assets/img/workpic41.jpg" alt />
            <br />△曾负责的一个项目卡片分类原始数据
            <br />
            <br />其中 CardName 纵列是原始卡片，每个 Sort 列是每个被调研对象的相对应卡片的分组归属数据。
            有多少个被调研对象，就有多少个纵列。
            <br />原始的数据可以依据卡片矩阵相关度和群簇分析两种方式进行处理。
            <br />
            <br />
            <h4>卡片矩阵相关度</h4>
            <br />卡片矩阵相关度主要是用来查看用户倾向的卡片分组情况和分组命名情况，
            可以直接根据量化结果找出最佳的卡片分组方式和卡片分组的最佳命名，
            或者作为卡片分组和分组命名提供非常有用的参考。
            <br />
            <br />一种最常用的相关度分析方式就是卡片-分组名矩阵归类，这种方法是把原始卡片作
            为纵轴把所有的被调研对象曾经列出的分类名作为横轴列出一个矩阵，然后把用户
            的选择以百分比标示出来，当然这种方法适合于开放式的，未预设分组的卡片分类法：
            <br />
            <br />
            <img src="./../../assets/img/workpic42.jpg" alt />
            <br />△卡片-分组名矩阵归类
            <br />
            <br />另一种相关度分析方式是卡片间相似度分析矩阵，依据用户的分组情况得出各卡片相互之间的相似度，
            这个分析结果很难直接拿来作为分类依据，但一般可以用来作为信息架构的重要参考资料。
            <br />
            <br />
            <img src="./../../assets/img/workpic43.jpg" alt />
            <br />△卡片间相似度分析
            <br />
            <br />
            <h4>聚类群簇分析</h4>
            <br />聚类群簇分析因为需要专业的群簇分析算法和相关专业知识，所以一般采用专业分析工具来完成这个工作，
            如 EZSORT，或者前文提到的 Optimalworkshop 在线卡片分类工具，也提供了专业的卡片聚类群簇分析功能。
            <br />
            <br />
            <img src="./../../assets/img/workpic44.jpg" alt />
            <br />△EZSORT卡片分析工具
            <br />
            <br />这种聚类群簇分析有两种主要的分析方式：完全一致方法（Actual Agreement method）和最优合并方法（Best Merge Method）。
            <br />
            <br />前者重视各卡片之间的差异性，只要有差异就分别列出。
            <br />
            <br />
            <img src="./../../assets/img/workpic45.jpg" alt />
            <br />△完全一致方法
            <br />
            <br />后者重视相互之间的一致性和同源关系，部分一致就归入一类。
            <br />
            <br />
            <img src="./../../assets/img/workpic46.jpg" alt />
            <br />△最优合并方法
            <br />
            <br />这两种方法因为目标不同，侧重点不同从而在进行信息架构分析时各有不同作用，一般都是要结合这两种不同的方法共同分析。
            <br />
            <br />以上就是卡片分类法的信息整理分析工具和方法，有了这些原始数据，我们就可以依据它们来完成我们的信息架构工作了。
            <br />
            <br />
            <h3>7. 归纳整理信息架构</h3>
            <br />信息整理分析完成后，我们就可以根据得到的结果基本推导出项目的信息架构。
            <br />
            <br />如果是开放式卡片分类分组名未确定的情况下，我们可以通过卡片-分组名矩阵归类法找出最适合的分组名，可以通过卡片间相似度分析矩阵得出卡片相互之间的或紧密或疏离的关系。
            <br />
            <br />通过聚类群簇分析可以对照分组名找出适合的分组数量，因为卡片之间关系越疏离，则从右侧分叉越早，卡片之间关系越紧密，则从右侧分叉越晚；最紧密的几张卡片之间甚至没有分叉。
            从这种树状结构中就能基本看出卡片之间的逻辑关系。
            <br />
            <br />
            <img src="./../../assets/img/workpic47.jpg" alt />
            <br />△群簇分析
            <br />
            <br />如上图邮轮项目中「系统设置」和「我的行程/个人消费记录/个人信息维护」这 4 张卡片，究竟是需要分为两组，还是合并为一组，则需要根据现有分组数量、需要分组数量等因素综合考虑。
            <br />
            <br />通过综合参考上述分析结果后，基本上可以给出符合逻辑关系的，符合用户心理预期的信息架构。
            <br />
            <br />
            <h3>8. 应用于实际项目</h3>
            <br />把符合用户心理预期和实际逻辑关系的信息架构应用于实际项目中，还需要根据项目需求、App 本身导航形式等因素综合考虑。如果 App 导航是采用 OTA 在线旅游预订平台那种较常用的瓦片式导航，
            那么可以允许存在较多的分组，如果采用底部导航栏导航，一般来说不应超过 4 个导航分组。
            <br />
            <br />
            <img src="./../../assets/img/workpic48.jpg" alt />
            <br />△卡片式导航应用于实际项目
            <br />
            <br />
            <br />
            <br />

            <div class="author">
              非特殊说明，本文版权归原作者所有，转载请注明出处
              本文地址：https://www.uisdc.com/card-sorting-2
            </div>
          </div>
        </div>
      </div>
      <!-- content -->
      <!-- copyright start -->
      <div class="copyright">
        <div class="content">
          <div class="copytext text-center">Copyright(C)2019 nn.365d1.com . All rights reserved.</div>
        </div>
      </div>
      <!-- copyright end -->
      <div class="design-header">
        <div class="design-header-title color-white text-center">作品集</div>
      </div>
      <div class="content">
        <!-- 导航栏 开始 -->
        <div class="navbox">
          <!-- 搜索栏 -->
          <div class="searchbox">
            <form action class="parent">
              <input type="text" class="search" placeholder="请输入您要搜索的作品名称" />
              <input type="button" name id class="btn" />
            </form>
          </div>

          <!-- 导航列表 开始 -->
          <div class="navlist-ui">
            <ul>
              <li class="now" id="cur">
                <a href="#">UI设计</a>
              </li>
              <li>
                <a href="#">网页设计</a>
              </li>
              <li>
                <a href="#">平面设计</a>
              </li>
              <li>
                <a href="#">手绘插画</a>
              </li>
              <li>
                <a href="#">其他</a>
              </li>
            </ul>
          </div>
          <!-- 导航列表 结束 -->
        </div>
        <!-- 导航栏 结束 -->

        <MenuComponent></MenuComponent>

        <div class="backtop">
          <a href="#top" target="_self">
            <img src="./../../assets/img/icon_backtop.png" alt />
          </a>
        </div>

        <!-- 文章box 开始 -->
        <div class="articalbox">
          <div class="maintitle text-center">Facebook 重大改版背后，揭晓了2019年的4个关键设计趋势</div>
          <div
            class="note-date text-center"
          >2019-05-24&nbsp;&nbsp;&nbsp;&nbsp;in&nbsp;&nbsp;作品集/UI设计</div>
          <div class="line"></div>
          <div class="note-content">
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;作为一个世界级的社交媒体平台，Facebook 如今的用户体量已经相当可观了。
            不过由于种种原因，国内少有人会主动关注相关的信息。作为每年 Facebook
            团队的盛事，F8 大会上通常会发布新产品，公布新功能，呈现新趋势。
            虽然 F8 大会所涉及到的产品我们大多不太可能用得上，但是关于设计、体验和产品，
            它所呈现出来的趋势，无疑是价值非凡的。
            <br />
            <br />
            <h3>关键词：隐私</h3>
            <br />对于绝大多数的国内用户而言，Facebook 是一个相对遥远的社交平台。
            但是这并不影响 Facebook 成为世界上最有影响力的社交媒体平台之一。
            在过去的十年之中，Facebook 正如同扎克伯格所期望的那样，逐渐构建成为一个庞大的全球社区。
            与此同时，庞大的体量和巨大的用户基数以及相对放任的用户隐私政策，使得 Facebook
            所投下的阴影同样巨大，这导致它在英国脱欧和美国大选中扮演了不光彩的角色，
            而这应该只是诸多不良后果之一。作为一个社交平台，Facebook 本身还有很多问题，
            但是这次 F8 大会上，整个 Facebook 主动站出来面对这一切。
            <br />未来应该是私密的。
            <br />
            <br />「噩梦般的日子」应该是正在洗心革面的扎克伯格和 Facebook 在过去几年间的真实写照。
            败在隐私政策上的 Facebook，在这一次的 F8 大会上毅然决然地选择了「隐私」作为主题。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic01.png" />
            「也许在隐私权这件事情上，我们所拥有的口碑并不是最好的。
            但是我承诺我们会尽力将这件事情做到最好，为我们的产品开启新的篇章。」
            <br />
            <br />扎克伯格在 F8 大会的舞台上，以这句话结束了他的开场白。
            洗心革面的 Facebook 相应地也带来了全新的设计和几经优化过的若干新产品、新功能。
            <br />
            <br />
            <h3>新设计：FB5</h3>
            <br />Facebook 的视觉设计经历过四次大幅度的重设计，作为一个承载大量成熟产品的平台，Facebook 的每一次变化通常都会影响到大量的公司和许多平台产品，
            从某种意义上，Facebook 重设计所带来的影响并不亚于 iOS 和 Android 的设计更新。
            <img
              class="workpic"
              src="./../../assets/img/workpic02.png"
            />
            <br />
            <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;作为第五个大版本，Facebook 将这一版本的重设计命名为 FB5。这套全新的设计彻底去掉了之前经典的 Facebook 蓝为主的整套配色方案，整套设计走的是简约的白色风格为主，并且紧跟时下各大平台的 UI 趋势，推出了相应的深色系的主题版本，不过黑色主题并没有在第一时刻更新，甚至白色主题的更新也是在全世界范围内逐步推广更新，
            就目前的反馈信息来看，各国用户所看到的新的 FB5 风格下的 UI 界面细节，还有着微妙的差别。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic03.png" />
            <br />
            <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;目前，按照 Facebook 官方的说法，深色模式界面将会优先在视频平台 Facebook Watch 上登录，
            随后会逐步推广到诸如 Facebook Messenger 等 APP 上。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic04.png" />
            <br />
            <br />目前，Facebook 的官方设计中心中还没有相关的设计素材和资源更新，
            估计还需要等 Facebook 官方的更新跟上之后，才会逐步面向大众推出。
            <br />
            <br />
            <h3>4个重要的设计趋势</h3>
            <br />用户隐私是这次 F8 大会的核心议题，对于用户个人信息
            和诉求的关注也是这一次 Facebook 平台和应用更新的重要核心。
            <br />
            <br />作为很少会用到 Facebook 的国内用户，逻辑上而言这些平台和应用的更新，同我们关系不大。但是这次 F8 大会最有价值的内容，是这些更新所呈现出来的设计趋势。
            作为一个世界级的平台，它的关注点无疑有着重要的参考价值。
            <br />
            <br />
            <h3>更简约：降低无关信息干扰</h3>
            <br />和 5 年前相比，如今用户在任何一个平台上所接收到的信息，提高了近乎一个数量级。其中主动推送到用户眼前的通知和各种信息，频率已经非常密集了。
            无论是桌面端还是移动端，高度饱和的视觉信息，让原本更重要的内容很难被凸显出来。
            <img
              class="workpic"
              src="./../../assets/img/workpic05.png"
            />
            <br />作为一套全新的设计规范，FB5 的整套设计语言无疑是统一一致的。更重要的是，新的 FB5 的设计语言通过削减枝节，
            让页面中的内容和信息更突出，在这样的设计之下，用户无疑更容易注意到内容本身。
            <br />由繁入简，这是大势所趋。
            <br />
            <br />
            <h3>更轻量：对抗越来越重的时代</h3>
            <br />用户等待网页加载的平均时长，在 2012 年的时候是 9 秒，而到 2016 年的时候只有 2 秒。
            <br />
            <br />英国卫报通过自己 Ophan 平台统计用户阅读文章的时长时候发现，绝大多数的用户阅读长文章的时候，只会花费 10 秒左右快速扫读。
            <br />
            <br />而用户在浏览微博、Twitter 这样的信息流式的社交媒体内容的时候，每条内容的平均停留时长不会超过 1.5 秒。
            <br />
            <br />设计要轻量化，内容要轻量化，Facebook 甚至在产品安装包上竭尽全力做轻量化，轻量化意味着更快速。
            更快下载，更快打开，更快获得。而这也是整个发布会当中最值得注意的细节。
            <img
              class="workpic"
              src="./../../assets/img/workpic06.png"
            />
            Facebook Massenger 作为 Facebook 社交生态中的核心，这次更新的目标不是高大全，而是更轻量──安装包从最初的 127M 缩减到 30M 以内，更快安装。而 FB5 的整个设计方向，也暗合了这次轻量化的诉求。
            <br />
            <br />与此同时，Facebook 官方公布的 APP 打开速度是在 1.3 秒以内，用户立刻就可以看到收到的信息。有空的同学可以自己测试一下打开微信和微博需要多长时间，作为对比。
            <br />
            <br />作为一款更加轻量级的 APP，Facebook Massenger 也变得更加省电。注意到没有，从现在开始，省电已经成为了一个 APP 的卖点了。
            <br />
            <br />在 5G 和高性能芯片成为主流的今天，Facebook 并没有在核心应用上继续做加法，而是向着相反方向，「毫秒必争」地追求疾速体验。
            <br />
            <br />
            <h3>更沉浸：聚焦更重要的内容</h3>
            <br />
            <img class="workpic" src="./../../assets/img/workpic07.png" />
            <br />
            <br />从某种意义上来说，深色系的界面主题并不是什么稀奇的设计，只不过，对于影响广泛的世界级平台产品而言，在这件事情上会更加谨慎，毕竟深色系的界面并不是简单的背景由白变黑。
            比如苹果的 Mac 系统也只是在 macOS 13 Mojave 上才开始应用 Dard mode ，而 iOS 系统至今还没有推出相应的深色模式。（小道消息称今年 6 月的 WWDC 上我们将在新的 iOS 系统中看到深色模式）
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic08.png" />
            <br />
            <br />Facebook 旗下的系列产品，根据重要性和所需专注度的程度，会先后更新深色模式，其中最先更新的是视频娱乐内容平台 Facebook Watch，而社交通讯核心
            Facebook Massenger 和网页版会紧随其后，并且分梯次地为世界各国的用户推送，逐渐铺开。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic09.png" />
            <br />
            <br />深色系主题的推出，势在必行。现代人每天盯着屏幕的时间越来越长，深色系主题不仅仅能够在一定程度上缓解视力疲劳（尤其在晚上），
            更重要的是，深色模式是一种典型的「沉浸模式」。
            <br />
            <br />“这其实不仅仅和对比度有关系，它和用户的日常使用环境和时间也有着极深的关联：绝大多数的娱乐活动都发生在晚上，
            并且大家会愉悦地享受相对昏暗的房间环境。丰富多彩的视觉内容，也同样会在深色系的 UI 上显得更加炫目……昏暗的环境让人放松和沉浸，
            太亮的背景则会让人紧张，这也是深色系 UI 的设计来源和基础：设备、内容、活动和场景。”──《想使用深色系UI，这些注意事项你一定要了解》
            <br />
            <br />信息量的暴增和用户注意力的涣散直接相关，而沉浸式的设计，则是数字产品对抗这种劣化趋势的有效手段，
            也是用户体验提升的一个关键点。
            <br />
            <br />当然，在产品的沉浸化设计上，Facebook 所做的工作并不只在深色主题上。色彩更加鲜亮的可定制对话框、
            几经优化后的交互路径、不用数据线约束的 VR 设备 OCULUS 则在沉浸式的体验上走的更远。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic10.png" />
            △ Photo by Amelia Holowaty Krales / The Verge
            <br />
            <br />
            <h3>更个人：专注个人的内在诉求</h3>
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic11.png" />
            <br />
            <br />在隐私政策上连续栽跟头的 Facebook ，将隐私和安全作为这次发布会上的核心议题来推进。
            这一点几乎可以从发布会上平台更新乃至每个产品上都有所体现。以往各大科技企业在发布会
            上都会强调用户体验，强调用户，但是从来没有一场发布会能像 2019 年这场 F8 大会上这样，
            所有上台演讲的 Facebook 负责人话里话外都说着「你最重要」这四个字。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic12.png" />
            <br />
            <br />不止是在功能上围绕着用户的隐私和安全来推进，在具体的产品上，也大多围绕着用户本身的个人诉求、垂直到更内化的细节上去做规划。
            <br />
            <br />以 Groups Tab 为例，它会在现有基础上，帮助用户更快匹配上符合自己兴趣爱好的圈子；
            Meet New Friends 功能，则专注帮助用户开拓新的圈子；Facebook Dating
            则是聚焦于恋爱和亲密关系的运营。值得注意的是，Facebook 非常贴心地将
            Facebook Dating 中用户所使用的帐号将会和自己的主帐号保持独立的关系，
            恋爱相关的信息可以只对部分用户可见，私密性和可控性更强。而涉及到恋爱匹配的 Secret Crush
            也是类似，只有当双方在各方面都「呼应上了」之后，才会被告知匹配成功。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic13.png" />
            <br />
            <br />如今已经属于 Facebook 旗下的社交应用 Instagram
            也在这次发布会上推出了一系列的功能更新，最直接的变化，是更加强大的相机功能。
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic14.png" />
            <br />
            <br />但是，更加令人值得关注的，是 Instagram 降低了点赞功能的优先级和权重，并且更加关注用户的敏感情绪──他们推出了 Away mode。
            <br />
            <br />当用户处于脆弱敏感时期的时候，打开 Away mode 之后，将在保留帐号的情况下，不会收到各种活动通知和提醒。
            <br />
            <br />「在生命中的敏感时期里，比如处于情绪低潮或是正在分手的阶段，和灵敏的社交媒体切断关系。」
            <br />
            <br />
            <img class="workpic" src="./../../assets/img/workpic15.png" />
            <br />
            <br />此外，Instagram 还准备干预网络暴力。一旦系统检测到有负面评论的时候，就会主动「干预」，
            给予发布负面评论的用户予以警告提示。Instagram 官方并非直接阻止用户发布内容，
            而是希望借由一系列的处理，让用户停下来想一下。（重新组织一下语言？）
            <br />
            <br />
            <h3>其实好戏在后面</h3>
            <br />当然，单从视觉和 UI 设计的角度上来说，F8 大会的价值似乎并没有那么高。
            别着急，5 月 9 号，Google I/O 大会就开始了，Material Design、
            新系统 Android Q 以及海量的谷歌产品的发布与更新，在未来 24 小时内，就可以看到了，这更值得期待。
            <br />
            <br />
            <div class="author">
              非特殊说明，本文版权归原作者所有，转载请注明出处
              本文地址：https://www.uisdc.com/facebook-2019-f8-trends
            </div>
          </div>
        </div>
      </div>
      <!-- content -->
      <!-- copyright start -->
      <div class="copyright">
        <div class="content">
          <div class="copytext text-center">Copyright(C)2019 nn.365d1.com . All rights reserved.</div>
        </div>
      </div>
      <!-- copyright end -->
    </div>
  </div>
</template>

<script>
import MenuComponent from "../../../src/components/MenuComponent.vue";

export default {
  name: "CaseContent03",
  components: {
    MenuComponent
  }
};
</script>
